УчетИНагрузкаППС/src/Documents/НормаУчебнойНагрузки/НормаУчебнойНагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НормаУчебнойНагрузки</name>
  <registerRecords>InformationRegister.НормаУчебнойНагрузки</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделенияТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасовПрочее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>УченаяСтепень</name>
      <type>
        <types>CatalogRef.УченыеСтепени</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетИНагрузкаППС/src/InformationRegisters/НормаУчебнойНагрузки/НормаУчебнойНагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормаУчебнойНагрузки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УченаяСтепень</name>
    <type>
      <types>CatalogRef.УченыеСтепени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетИНагрузкаППС/src/Documents/НормаУчебнойНагрузки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьДублиПодразделений();
	СформироватьПредставлениеПодразделений();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвиженияНормаУчебнойНагрузки();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияНормаУчебнойНагрузки()
	
	Движения.НормаУчебнойНагрузки.Записывать = Истина;
	
	Для Каждого СтрокаТаблицы Из Должности Цикл
		Если СтрокаТаблицы.КоличествоЧасов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Подразделения.Количество() = 0 Тогда						
			Запись = Движения.НормаУчебнойНагрузки.Добавить();	
			Запись.Период = Дата;
			Запись.УчебныйГод = УчебныйГод;
			ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
		Иначе
			Для Каждого СтрокаПодразделение Из Подразделения Цикл
				Запись = Движения.НормаУчебнойНагрузки.Добавить();	
				Запись.Период = Дата;
				Запись.УчебныйГод = УчебныйГод;
				Запись.Подразделение = СтрокаПодразделение.Подразделение;
				ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоЧасовПрочее > 0 Тогда
		Если Подразделения.Количество() = 0 Тогда
			Запись = Движения.НормаУчебнойНагрузки.Добавить();	
			Запись.Период = Дата;
			Запись.УчебныйГод = УчебныйГод;
			Запись.КоличествоЧасов = КоличествоЧасовПрочее;	
		Иначе
			Для Каждого СтрокаПодразделение Из Подразделения Цикл
				Запись = Движения.НормаУчебнойНагрузки.Добавить();	
				Запись.Период = Дата;
				Запись.УчебныйГод = УчебныйГод;
				Запись.КоличествоЧасов = КоличествоЧасовПрочее;	
				Запись.Подразделение = СтрокаПодразделение.Подразделение;				
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДублиПодразделений()	
	ТЗ = Подразделения.Выгрузить();
	ТЗ.Свернуть("Подразделение");
	Подразделения.Загрузить(ТЗ);
КонецПроцедуры

Процедура СформироватьПредставлениеПодразделений()
	
	ПодразделенияТекст = "";
	
	Если Подразделения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодразделений = Подразделения.Выгрузить().ВыгрузитьКолонку("Подразделение");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Наименование
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	Подразделения.Ссылка В (&МассивПодразделений)");
	Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
	
	МассивНаименований = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	ПодразделенияТекст = СтрСоединить(МассивНаименований, ", ");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
